{"fit": "fit", "user_id": "420272", "bust size": "34d", "item_id": "2260466", "weight": "137lbs", "rating": "10", "rented for": "vacation", "review_text": "An adorable romper! Belt and zipper were a little hard to navigate in a full day of wear/bathroom use, but that's to be expected. Wish it had pockets, but other than that-- absolutely perfect! I got a million compliments.", "body type": "hourglass", "review_summary": "So many compliments!", "category": "romper", "height": "5' 8\"", "size": 14, "age": "28", "review_date": "April 20, 2016"}
{"fit": "fit", "user_id": "273551", "bust size": "34b", "item_id": "153475", "weight": "132lbs", "rating": "10", "rented for": "other", "review_text": "I rented this dress for a photo shoot. The theme was \"Hollywood Glam and Big Beautiful Hats\". The dress was very comfortable and easy to move around in. It is definitely on my list to rent again for another formal event. ", "body type": "straight & narrow", "review_summary": "I felt so glamourous!!!", "category": "gown", "height": "5' 6\"", "size": 12, "age": "36", "review_date": "June 18, 2013"}
{"fit": "fit", "age": "116", "size": 4, "item_id": "1063761", "rating": "10", "rented for": "party", "review_text": "This hugged in all the right places! It was a perfect dress for my event and I received so many compliments on it. Not to mention customer service was great getting this to me in less than 24 hours!", "review_summary": "It was a great time to celebrate the (almost) completion of my first year of law school.", "category": "sheath", "height": "5' 4\"", "user_id": "360448", "review_date": "December 14, 2015"}
{"fit": "fit", "user_id": "909926", "bust size": "34c", "item_id": "126335", "weight": "135lbs", "rating": "8", "rented for": "formal affair", "review_text": "I rented this for my company's black tie awards banquet.  I liked that this dress was short but was a little fancier with the sequins. (I generally don't care for long dresses.)  I would describe the color as more rose gold than yellow gold.  I have blonde hair and fair skin, and the color was very flattering.  This is a very forgiving dress! It's form fitting without making you feel like you're squeezed into it.  I would rent this one again.  Highly recommend!", "body type": "pear", "review_summary": "Dress arrived on time and in perfect condition. ", "category": "dress", "height": "5' 5\"", "size": 8, "age": "34", "review_date": "February 12, 2014"}
{"fit": "fit", "user_id": "151944", "bust size": "34b", "item_id": "616682", "weight": "145lbs", "rating": "10", "rented for": "wedding", "review_text": "I have always been petite in my upper body and extremely athletic. \nI'm 5'9 and typically am a size 4,6,8 due to the fact I had a smaller upper frame and 34B cup. Depends what fabric were talking about too! \nHowever, because I have been lifting weights my back has grown (odd to add- but figured I'd say it knowing other people lift weights) My lat area is so wide that I was suffocating in a size 6. If I wasn't as muscular in my back I would've been fine. I would recommend to go up a size if you are into lifting weights and very broad in your upper body. ", "body type": "athletic", "review_summary": "Was in love with this dress !!!", "category": "gown", "height": "5' 9\"", "size": 12, "age": "27", "review_date": "September 26, 2016"}
{"fit": "fit", "user_id": "734848", "bust size": "32b", "item_id": "364092", "weight": "138lbs", "rating": "8", "rented for": "date", "review_text": "Didn't actually wear it. It fit perfectly. The fabric is a little thicker, so higher quality. Felt a bit too conservative for my taste. I rented it for the color and loved the berry shade of red.", "body type": "athletic", "review_summary": "Traditional with a touch a sass", "category": "dress", "height": "5' 8\"", "size": 8, "age": "45", "review_date": "April 30, 2016"}
{"fit": "fit", "user_id": "336066", "bust size": "34c", "item_id": "568429", "weight": "112lbs", "rating": "10", "rented for": "everyday", "review_text": "This dress is so sweet. I loved the print. The fit is loose with a tie for the waist, which means it should flatter most figures. Another win from Kate Spade!", "body type": "hourglass", "review_summary": "LITERALLY THE CUTEST DRESS EVER", "category": "dress", "height": "5' 3\"", "size": 4, "age": "27", "review_date": "December 7, 2017"}
{"fit": "fit", "user_id": "86661", "bust size": "34d+", "item_id": "130259", "weight": "118lbs", "rating": "10", "rented for": "formal affair", "review_text": "Fit was great. Maybe a little tight under the arms. ", "body type": "full bust", "review_summary": "Great dress, beautifully made.  I received lots of compliments!", "category": "dress", "height": "5' 3\"", "size": 8, "age": "65", "review_date": "January 1, 2013"}
{"fit": "fit", "age": "27", "bust size": "36d", "item_id": "1729232", "rating": "10", "rented for": "formal affair", "review_text": "I was nervous of it looking cheap when it arrived but I received a ton of compliments on it and it had built in support. I am a 36D and there was still that I was able to wear a bra with it with no problem. Wore with 3-4\" heels and it was perfect length.", "body type": "full bust", "review_summary": "Great for black tie event!", "category": "gown", "height": "5' 6\"", "size": 21, "user_id": "166228", "review_date": "June 27, 2016"}
{"fit": "fit", "user_id": "154309", "bust size": "32b", "item_id": "1729232", "weight": "114lbs", "rating": "10", "rented for": "formal affair", "review_text": "The dress was very flattering and fit perfectly through my stomach and hips. I have a booty so I always worry about how things are going to fit, but this was amazing. I have a small chest and didn't fill out the built in bra as much as I would have liked, but it still looked great and I was comfortable in it. The dress had more stretch and give than I thought it would. I was worried I wouldn't be able to enjoy dancing and while I couldn't bust out break dance moves, I was able to dance without feeling completely restricted. I am always a zero in dresses and this fit true to size. I'm short, 5'3\" and I thought the length was perfect with a heel. Overall I'm very pleased with my order!! Thank you RTR!", "body type": "petite", "review_summary": "This dress was everything! It was perfect for the masquerade ball we attended!", "category": "gown", "height": "5' 3\"", "size": 1, "age": "33", "review_date": "October 17, 2016"}
{"fit": "small", "user_id": "185966", "bust size": "34b", "item_id": "1077123", "weight": "135lbs", "rating": "8", "rented for": "party", "review_text": "The dress arrived with a small hole in the beading on the front but wasn't too noticeable. Glad I was able to get two sizes because the 4 was a little tight and would've made for an uncomfortable night of dancing! ", "body type": "athletic", "review_summary": "It was fun to wear a dress I wouldn't normally buy! ", "category": "dress", "height": "5' 3\"", "size": 12, "age": "33", "review_date": "January 2, 2018"}
{"fit": "large", "user_id": "533900", "bust size": "34b", "item_id": "130259", "weight": "135lbs", "rating": "8", "rented for": "wedding", "review_text": "This dress was absolutely gorgeous and I received so many compliments!  I wore it to a black tie NYE wedding, and even though it was short, I felt like the fabric, fit, and the way it sparkled made it fit in just fine with the other formal gowns.  I usually wear a 6 or an 8 in dresses.  I ordered a 4 and a 6, and true to other reviewers' comments, the 4 fit me very well.  The chest area was just a tad loose, but that typically happens when I try on dresses...nothing a more padded bra couldn't fix!  The cut and fit were very figure flattering.  By the end of the evening I experience a little chafing under my arms from the sequins, but that was after 5 hours and it was very minor.  Thank you RTR for a great first experience, I'll definitely be back!", "body type": "pear", "review_summary": "Stunning dress, perfect for a New Year's Eve wedding!", "category": "dress", "height": "5' 6\"", "size": 8, "age": "30", "review_date": "January 7, 2013"}
{"fit": "fit", "user_id": "87660", "bust size": "36a", "item_id": "1295171", "weight": "120lbs", "rating": "10", "rented for": "party", "review_text": "The S was snug but in a good way. I wore a push up bra, but this dress made me look like a 34C! I wore spanx, too. Overall great dress! The only downside was that the sequins ripped up my bachelorette sash. There were strings everywhere but still felt like a million bucks. ", "body type": "straight & narrow", "review_summary": "This dress made me feel so confident & sexy! ", "category": "sheath", "height": "5' 6\"", "size": 8, "age": "26", "review_date": "July 28, 2016"}
{"fit": "large", "user_id": "391778", "bust size": "36d", "item_id": "143094", "weight": "142lbs", "rating": "8", "rented for": "party", "review_text": "I ordered this dress as a replacement because I thought my original order would be too small.  This dress fit my abdomen well, but it hung slack around my shoulders and neck.  I wouldn't recommend a large size for apple body shapes; get the smaller size and let it hug you!", "body type": "apple", "review_summary": "Ordered this as a replacement dress", "category": "dress", "height": "5' 2\"", "size": 20, "age": "29", "review_date": "October 4, 2014"}
{"fit": "fit", "user_id": "721308", "bust size": "34b", "item_id": "123793", "weight": "118lbs", "rating": "10", "rented for": "formal affair", "review_text": "Fit great, super flattering", "body type": "athletic", "review_summary": "Stunning gown. Wore this for heart ball and received compliments all night", "category": "gown", "height": "5' 5\"", "size": 2, "age": "32", "review_date": "May 29, 2014"}
{"fit": "fit", "user_id": "829124", "bust size": "34c", "item_id": "2595752", "weight": "140lbs", "rating": "10", "rented for": "party", "review_text": "Medium would have been a better fit but large worked for a night out.  Pants were high enough that they wouldve looked cute with a crop top too.  Very comfortable.  Would love to own a pair.", "body type": "hourglass", "review_summary": "These leggings are awesome!", "category": "leggings", "height": "5' 7\"", "size": 20, "age": "30", "review_date": "May 16, 2016"}
{"fit": "fit", "user_id": "499943", "bust size": "34c", "item_id": "909221", "weight": "170lbs", "rating": "10", "rented for": "vacation", "review_text": "This dress is just darling. I would absolutely wear it again. It fits true to size with a little room. I have larger hips and this dress fit fine and highlighted my smaller waist.  It isn't too tight around your middle and I was really comfortable in this one. I wore it out to dinner in Vegas and really felt amazing. ", "body type": "pear", "review_summary": "Really cute and comfortable.", "category": "dress", "height": "5' 8\"", "size": 20, "age": "35", "review_date": "March 28, 2017"}
{"fit": "fit", "user_id": "339899", "bust size": "34d", "item_id": "1622747", "weight": "143lbs", "rating": "10", "rented for": "party", "review_text": "Little tight, but loved this dress!!!", "body type": "athletic", "review_summary": "LOVED", "category": "dress", "height": "5' 5\"", "size": 12, "age": "26", "review_date": "November 13, 2017"}
{"fit": "fit", "user_id": "649288", "bust size": "34b", "item_id": "172027", "weight": "115lbs", "rating": "8", "rented for": "wedding", "review_text": "This is a pretty and fun dress with vibrant colors. I thought the dress ran true to size. The picture of the dress on the model can make the dress seem too short, but the length was perfect for me who's a bit smaller in height.  I paired the dress with pink earrings (via RTR) and black heels.", "body type": "petite", "review_summary": "Semi-formal wedding", "category": "dress", "height": "5' 3\"", "size": 8, "age": "28", "review_date": "July 3, 2017"}
{"fit": "small", "user_id": "16800", "bust size": "34c", "item_id": "1229740", "weight": "135lbs", "rating": "10", "rented for": "formal affair", "review_text": "super cute, 8 was super tight so i wore the 10. if you have booty and hips prob want to get the 10. don't need bra and it has structure to give you shape. the train in the back is extra classy to give it another emphasis for formal. ", "body type": "petite", "review_summary": "gala ready ", "category": "gown", "height": "5' 6\"", "size": 21, "age": "33", "review_date": "November 16, 2017"}
{"fit": "fit", "user_id": "661150", "bust size": "36d", "item_id": "900878", "weight": "145lbs", "rating": "10", "rented for": "wedding", "review_text": "I rented this dress for a spring wedding. I had originally rented an 8 and 10 and when I saw that the straps were quite long (make sure you wear them criss-crossed), I contacted the RTR customer service who suggested sizing down. I did that and ended up wearing the 6. It fit great. I wore a backless sticky bra and was good all day! The top is fitted, so that helped to keep everything still while I was on the dance floor, too. The dress was casual enough for a daytime, outdoor ceremony, but also dressy enough for the party. The material is heavy and elegant - I received compliments all day long! I have bigger hips and was still able to size down due to the full skirt. I would recommend that instead of sizing up where you may be inadvertently showing more side boob than you might want! Lastly, I wore the Tova Blue Mohawk earrings which seem like they were made for this dress. Compliments on those as well. I can always count on RTR to make me look like a million bucks!", "body type": "hourglass", "review_summary": "Perfect for a spring wedding!", "category": "dress", "height": "5' 5\"", "size": 12, "age": "33", "review_date": "May 23, 2017"}
{"fit": "fit", "user_id": "983550", "bust size": "32d+", "item_id": "197391", "weight": "140lbs", "rating": "8", "rented for": "other", "review_text": "I wore this dress to my daughter's baptism. It was perfect for a more formal, daytime affair. I felt fashionable and put together, despite having the flu! I received many compliments. I paired the dress with nude pumps.", "body type": "hourglass", "review_summary": "Fashionable, conservative dress", "category": "dress", "height": "5' 6\"", "size": 12, "age": "30", "review_date": "February 22, 2015"}
{"fit": "fit", "user_id": "871659", "bust size": "36c", "item_id": "2736018", "rating": "10", "rented for": "work", "review_text": "Super cute; love the 3/4 length sleeves. With a wider sleeve, I always want something shorter so that it doesn't drag. I wore with black pants and pumps for the office, but could have dressed down with jeans too. If I didn't hate ironing so much (and this shirt definitely needs to be ironed!!) I would have bought it. The gathering at the sleeves prevents this from being too big overall.\n\nNote: wear with high-waisted pants or you'll show your stomach. Ladies who are smaller across the shoulders could probably size down one, but I like the oversized fit. ", "body type": "pear", "review_summary": "Wore to work", "category": "top", "height": "5' 5\"", "size": 20, "age": "32", "review_date": "March 16, 2017"}
{"fit": "fit", "user_id": "497541", "bust size": "34c", "item_id": "382883", "weight": "120lbs", "rating": "8", "rented for": "work", "review_text": "I loved everything about this dress! Well made with a great color combination ( pictures don't do it justice). My issue was after just having a baby, it did not hide the area I needed hiding & because of the way the skirt is shaped made me look slightly bigger. I think it the top dropped down just a tad longer it would have looked better. Not the fault of the dress. My body just did not work well with this style", "body type": "apple", "review_summary": "Well made dress & super trendy", "category": "dress", "height": "5' 6\"", "size": 1, "age": "21", "review_date": "February 1, 2016"}
{"fit": "fit", "user_id": "862005", "bust size": "32c", "item_id": "134393", "weight": "140lbs", "rating": "10", "rented for": "wedding", "review_text": "It fit perfectly - I have a small waist, normal-to-small bust and big hips, so it fit in all of the right places. It was borderline too short, but I usually prefer a bit of length. It was still easy to dance and sit in. I got lots of compliments and finally recommended RTR to a few friends!", "body type": "pear", "review_summary": "Great dress for a wedding with long ceremonies and lots of dancing. ", "category": "dress", "height": "5' 8\"", "size": 8, "age": "27", "review_date": "June 3, 2015"}
{"fit": "fit", "user_id": "85200", "size": 8, "item_id": "875667", "weight": "140lbs", "rating": "8", "rented for": "other", "review_text": "Absolutely beautiful dress. The details were incredible. \n\nPros:\n-Unique \n-Elegant and sophisticated\n\nCons\n-Extremely tight in the bust area (I had to wear a bra with no padding and it was still extremely tight). I don't know if sizing up would be ideal, as every other portion of the dress fit well. \n", "review_summary": "Elegance and sophistication ", "category": "dress", "height": "5' 6\"", "bust size": "32dd", "age": "30", "review_date": "October 21, 2017"}
{"fit": "fit", "user_id": "289165", "bust size": "32c", "item_id": "241461", "weight": "120lbs", "rating": "10", "rented for": "formal affair", "review_text": "This dress is absolutely perfect! I originally grabbed this dress in the Georgetown RTR store as a back-up because it just looked pretty \"eh\" while on the hanger, but when I tried it on, I instantly felt like a princess. I loved how it flowed, and it was such an easy dress to dance in all night. I'm 5' 6\" - 5' 7\", and the dress was about an inch or two too long, and there is way too much fabric and layering to hem it with the tape they sell at RTR, but that was easy to fix with one inch Jack Roger wedges (easier to dance in as well :)). Overall, the dress was amazing, the colors photographed perfectly, and  I felt great at my senior prom. ", "body type": "full bust", "review_summary": "Such an easy dress! Danced all night! ", "category": "dress", "height": "5' 6\"", "size": 4, "age": "20", "review_date": "April 28, 2016"}
{"fit": "small", "user_id": "610914", "bust size": "32c", "item_id": "1739627", "weight": "140lbs", "rating": "10", "rented for": "party", "review_text": "Lovely fabric, heavier than I imagined it would be (somehow I thought billowy, but its softer and stiffer than that) but it runs small around the ribcage - my normal size gapped 2 inches. I've sent it right back to try the larger size. Pretty!", "body type": "hourglass", "review_summary": "Runs small", "category": "dress", "height": "5' 3\"", "size": 4, "age": "32", "review_date": "March 10, 2016"}
{"fit": "fit", "user_id": "205922", "bust size": "34b", "item_id": "149913", "rating": "8", "rented for": "party", "review_text": "I wore this to a company holiday event and wanted something that would stand out.  I loved that it had long sleeves, making it feel modern but also more ideal for a company event, given that it did run short on me, being tall.  I got several compliments on the dress.  It fit well and the jersey material made it comfortable and stay in place. ", "body type": "straight & narrow", "review_summary": "So unique!", "category": "dress", "height": "5' 9\"", "size": 8, "age": "34", "review_date": "February 6, 2014"}
{"fit": "fit", "user_id": "513479", "bust size": "34d", "item_id": "1133906", "weight": "123lbs", "rating": "10", "rented for": "work", "review_text": "Will rent again", "body type": "hourglass", "review_summary": "The material was not what I was expecting (exceeded my expectations) received compliments all day ", "category": "sheath", "height": "5' 1\"", "size": 4, "age": "32", "review_date": "November 10, 2016"}
{"fit": "fit", "user_id": "110746", "bust size": "30dd", "item_id": "872951", "weight": "123lbs", "rating": "10", "rented for": "formal affair", "review_text": "Gorgeous fit, I ordered two sizes (Small and Medium), both were great, could go with either one. Small fit the best.", "body type": "hourglass", "review_summary": "Perfect color, fit and length", "category": "gown", "height": "5' 3\"", "size": 8, "age": "37", "review_date": "December 26, 2017"}
{"fit": "fit", "user_id": "854094", "bust size": "32c", "item_id": "123373", "weight": "122lbs", "rating": "10", "rented for": "wedding", "review_text": "The dress was beautiful and very comfortable.  The 4 actually was a little too long in the sleeve and the length.  The 2 was still a bit long but not a tripping risk.  It still was dragging a bit and I had to hold it up to walk and I am 5'5\" and was wearing a pretty high  heel.  I received a lot of compliments on the dress and felt very glamorous.  I like plain, simple clothes so I really loved this as it was elegant and had beautiful structure but not flashy.  And did I mention soooo comfortable!!!", "body type": "straight & narrow", "review_summary": "It was a very beautiful black tie wedding", "category": "gown", "height": "5' 5\"", "size": 4, "age": "50", "review_date": "November 9, 2017"}
{"fit": "fit", "age": "29", "size": 8, "item_id": "2155094", "rating": "10", "rented for": "date", "review_text": "I rented this for my birthday dinner at a downtown restaurant and loved every minute of it. This jumpsuit is super flattering, sexy, classy and comfortable. The only downside is the zipper, like other girls have mentioned. Difficult to zip by yourself. Highly recommend this and will definitely rent it again!", "body type": "petite", "review_summary": "Love, love, love it!", "category": "jumpsuit", "height": "5' 3\"", "user_id": "335467", "review_date": "November 3, 2016"}
{"fit": "fit", "age": "43", "size": 8, "item_id": "387552", "weight": "112lbs", "rating": "10", "rented for": "formal affair", "review_text": "Fit was good. Barely brushing the floor in the back with 3\" heels", "review_summary": "Felt pretty in this dress", "category": "gown", "height": "5' 3\"", "user_id": "845755", "review_date": "June 17, 2017"}
{"fit": "fit", "user_id": "681609", "size": 17, "item_id": "203856", "weight": "165lbs", "rating": "8", "rented for": "formal affair", "review_text": "I am 5'10\" and the Long was too short for me in the front. Had I been able to try this dress on in the store, I probably would not have rented it because I really didn't like how short it was. But other than that, the dress fit and felt great and I loved the way it looked. I just wish it had been longer.", "review_summary": "Very flattering and the perfect dress for the Gatsby themed New Years Eve party I attended.", "category": "gown", "height": "5' 10\"", "bust size": "36c", "age": "29", "review_date": "January 3, 2018"}
{"fit": "fit", "user_id": "858777", "bust size": "34c", "item_id": "1364569", "rating": "10", "rented for": "other", "review_text": "Dress fit well and had a very classy feel to it.  Rented it for a meeting I had to attend and was great for the occasion ", "body type": "athletic", "review_summary": "Very beautiful dress.  Classy!", "category": "sheath", "height": "5' 8\"", "size": 12, "age": "35", "review_date": "September 4, 2016"}
{"fit": "fit", "user_id": "729616", "bust size": "34d", "item_id": "1064397", "weight": "143lbs", "rating": "8", "rented for": "wedding", "review_text": "Wore this to a semi-formal wedding and it was just perfect! The material was quite thick which was nice for being on the ocean and for smoothing coverage as well as when it got cooler at night, but if it had been any hotter it would have been too much. Fit true to size.  Wore it with 4 inch wedges and it was the perfect length.", "body type": "hourglass", "review_summary": "Love this dress! Super flattering and fun but still classy.", "category": "gown", "height": "5' 3\"", "size": 16, "age": "32", "review_date": "October 7, 2015"}
{"fit": "fit", "user_id": "908171", "bust size": "34c", "item_id": "174086", "weight": "130lbs", "rating": "8", "rented for": "wedding", "review_text": "I rented this dress in both a 0 and a 2 and ended up going with the 0, and it was still a little bit big for me around the waist. It would have been perfect to cinch with a belt, but I couldn't find one in such short notice.\n\nProbably the most comfortable dress I've ever worn. The lacy detail around the sleeves were my favorite part, and the pockets were also very helpful while dancing at the wedding. I would highly recommend this dress if you want to be comfortable, and not worry about it being too short. ", "body type": "straight & narrow", "review_summary": "Was a littttttle big for me, but still super comfortable", "category": "dress", "height": "5' 6\"", "size": 1, "age": "29", "review_date": "May 12, 2014"}
{"fit": "fit", "user_id": "276186", "bust size": "34b", "item_id": "2251739", "weight": "120lbs", "rating": "10", "rented for": "everyday", "review_text": "I wore the with jeans to my son's toddler bday party on the weekend, and also wore it to work with a black flare mini and boots.  It is a stylish, versatile piece.  I liked that the sweater was fitted and was not too long/hit at hipbones.", "body type": "athletic", "review_summary": "Sweater with Style", "category": "sweater", "height": "5' 5\"", "size": 8, "age": "47", "review_date": "March 4, 2016"}
{"fit": "fit", "user_id": "330024", "bust size": "32d", "item_id": "182915", "rating": "10", "rented for": "party", "review_text": "This dress fit perfectly, and the ruched sides covered any imperfections.  Really lovely dress.", "body type": "hourglass", "review_summary": "Great dress!", "category": "dress", "height": "5' 6\"", "size": 8, "age": "53", "review_date": "December 7, 2011"}
{"fit": "fit", "user_id": "351728", "bust size": "34d", "item_id": "1497935", "weight": "130lbs", "rating": "10", "rented for": "other", "review_text": "I wore this for a wedding shower and it was perfect. It was a great length, the bust fit great, the sleeves weren't too tight. i loved it. I ended up going with the medium since it fit better and i think i would have had some trouble zipping up the small. I had my daughter with me and the times i had to squat down to put her in her car seat i had to be cautious not to flash anyone, but you can avoid that situation pretty easily.  between the top and the skirt there is a thick seem, but for me it was fine. for others that have a thicker torso it might be tight. got lots of complements!", "body type": "athletic", "review_summary": "Fit great, felt great", "category": "dress", "height": "5' 1\"", "size": 14, "age": "31", "review_date": "April 10, 2017"}
{"fit": "fit", "user_id": "606693", "bust size": "36b", "item_id": "1542652", "weight": "145lbs", "rating": "8", "rented for": "wedding", "review_text": "This dress is gorgeous and really accentuates all your features! With that being said, it does show imperfections in your tummy area, but not as bluntly as other tight fitting dresses. I will say one of the only issues I had was continually having to adjust the dress around my chest (with it being a strapless) because the lining kept show and slipping down. Other than that, it was a phenomenal choice and I am VERY happy with it! ", "body type": "athletic", "review_summary": "This dress definitely brought the WOW factor! Would definitely recommend!", "category": "dress", "height": "5' 8\"", "size": 12, "age": "27", "review_date": "November 6, 2017"}
{"fit": "small", "user_id": "126879", "bust size": "36c", "item_id": "1406963", "weight": "155lbs", "rating": "4", "rented for": "wedding", "review_text": "Huge on top and super tight in the waist", "body type": "pear", "review_summary": "strange fit", "category": "dress", "height": "5' 4\"", "size": 28, "age": "38", "review_date": "June 20, 2017"}
{"fit": "small", "user_id": "956351", "bust size": "34b", "item_id": "1854157", "weight": "130lbs", "rating": "10", "rented for": "wedding", "review_text": "Great dress! super comfortable. M fit but too snug for my liking.   Hem hit right above knee. Would rent again !", "body type": "hourglass", "review_summary": "Love!!", "category": "dress", "height": "5' 4\"", "size": 20, "age": "33", "review_date": "July 8, 2015"}
{"fit": "fit", "user_id": "214108", "bust size": "32d", "item_id": "2872079", "weight": "105lbs", "rating": "10", "rented for": "everyday", "review_text": "This jacket is perfect.  It's a neutral color that goes with everything.  Has great details... zippers, pockets, and belt which make it more than just a regular leather jacket.  It's snug, but that's the way it's meant to be worn.  I felt it fit very true to size.  I would have love to kept it longer, but the weather got much too cold!", "body type": "petite", "review_summary": "Great Color and detail", "category": "jacket", "height": "5' 2\"", "size": 4, "age": "43", "review_date": "November 23, 2016"}
{"fit": "fit", "user_id": "345053", "bust size": "34b", "item_id": "1754771", "weight": "135lbs", "rating": "8", "rented for": "wedding", "review_text": "Overall, I was pleased with my choice in this dress. I certainly received compliments on it, and the color was fun. (It looks pretty pink here because of the lighting, but it's more purple). The only frustrating thing was that there was no way to wear a bra with it, and unless you have a full enough chest, the top will swallow you. So I had to buy those sticky implants that actually worked really well to fill out the dress nicely and give me a little more support. Other than that, no complaints. Loved the pockets! And it was a truly high quality dress in terms of the material and the cut.", "body type": "athletic", "review_summary": "comfortable and quality material", "category": "gown", "height": "5' 5\"", "size": 8, "age": "27", "review_date": "July 14, 2015"}
{"fit": "fit", "user_id": "407375", "bust size": "34a", "item_id": "321674", "weight": "130lbs", "rating": "6", "rented for": "everyday", "review_text": "It was way to short, I wasn't able to wear it ", "body type": "straight & narrow", "review_summary": "Cute, but really short! ", "category": "shirtdress", "height": "5' 8\"", "size": 8, "age": "29", "review_date": "November 22, 2016"}
{"fit": "fit", "user_id": "804645", "bust size": "36d", "item_id": "1312996", "weight": "190lbs", "rating": "10", "rented for": "formal affair", "review_text": "The side zipper was being difficult due to the band, but don't give up, it'll go.", "body type": "hourglass", "review_summary": "Everyone complimented me on the gown.  It looks a lot better on then the hanger!!", "category": "gown", "height": "5' 8\"", "size": 28, "age": "48", "review_date": "January 19, 2015"}
{"fit": "fit", "user_id": "979773", "bust size": "34b", "item_id": "1281865", "rating": "10", "rented for": "wedding", "review_text": "This dress is not my typical style (I normally wear something fitted all over for formal events), but I kept going back to this one for whatever reason for a fall wedding I had coming up. It did not disappoint. I fluctuate between a 2 and 4 depending on the brand so got both sizes and went with the 2. The differences between the two were very subtle, I just preferred the smaller size since it was more fitted up top and I liked where the skirt fell lengthwise. It ran pretty true to size, but I thought the skirt fell longer than it appeared in the photo (and I'm 5 foot 6 so I normally don't have issues with length), but I didn't think it took away from the look at all. It was super comfortable which is high on my list, it was really fun to dance in, and was very unique in comparison to other guests at the winter wedding I wore it to. It's a great rental - you won't regret it!", "body type": "straight & narrow", "review_summary": "Loved this dress", "category": "dress", "height": "5' 6\"", "size": 4, "age": "31", "review_date": "January 2, 2017"}
{"fit": "fit", "user_id": "268942", "bust size": "36d", "item_id": "1829354", "weight": "150lbs", "rating": "8", "rented for": "everyday", "review_text": "Cotton jersey knit material.  Comfortable and flattering, I dressed it down with a jacket and booties.", "body type": "athletic", "review_summary": "comfortable can dress up or down.", "category": "dress", "height": "5' 4\"", "size": 14, "age": "36", "review_date": "October 22, 2017"}
{"fit": "fit", "user_id": "390300", "size": 12, "item_id": "1457605", "weight": "145lbs", "rating": "10", "rented for": "work", "review_text": "I rented this for work.  I wanted a transitional piece that would work for the cold mornings, but also something I wouldn't be dying in during  the afternoon when it warmed up.  This dress was perfect! The material was light but the coverage of the dress balanced it out.  The fit was super flattering, I felt so thin.  I got compliments on it all day long, I wish I kept it longer!! ", "review_summary": "Perfect Work Dress ", "category": "dress", "height": "5' 7\"", "bust size": "34d", "age": "27", "review_date": "October 23, 2017"}
{"fit": "large", "user_id": "375120", "bust size": "32c", "item_id": "973512", "weight": "136lbs", "rating": "10", "rented for": "party", "review_text": "This dress definitely runs a little large - especially since it's more of a loose style so I would suggest sizing down. It also runs a bit short, so if you are taller or have longer legs like me it definitely will not hit the ground. \n\nThe material is incredibly soft and the pattern looks like stripes in photos but is more like a watercolor painting - received lots of compliments on this one.", "body type": "athletic", "review_summary": "Gorgeous flowy dress", "category": "dress", "height": "5' 7\"", "size": 4, "age": "35", "review_date": "October 18, 2017"}
{"fit": "fit", "user_id": "597998", "bust size": "34dd", "item_id": "2884139", "weight": "145lbs", "rating": "10", "rented for": "party", "review_text": "It fit me perfectly and everyone complimented me!", "body type": "hourglass", "review_summary": "I loved this jumpsuit.", "category": "jumpsuit", "height": "5' 7\"", "size": 12, "age": "34", "review_date": "April 29, 2017"}
{"fit": "fit", "user_id": "355308", "size": 8, "item_id": "1795313", "weight": "120lbs", "rating": "10", "rented for": "everyday", "review_text": "Fit: Not so tight that it shows your lumps, not too loose that it makes you lumpy. \n\nMaterial: Substantial and luxe.\n\nSizing: I'm 5'3\" and the 4R fit perfect with Halogen slip-ons.", "review_summary": "I love this dress. I'm already talking to RtR about buying it. <3", "category": "maxi", "height": "5' 2\"", "bust size": "34b", "age": "40", "review_date": "November 11, 2015"}
{"fit": "fit", "user_id": "970594", "bust size": "34c", "item_id": "1048184", "weight": "115lbs", "rating": "10", "rented for": "vacation", "review_text": "This dress fit great, but it did ride up as I walked. I didn't let it get me down, because it looked so great. \n We were off to a concert that night, but stopped off for an impromptu renewal of our vows with Elvis - this dress was so fun and just added to the tone of our evening. ", "body type": "hourglass", "review_summary": "Vegas ready.", "category": "dress", "height": "5' 1\"", "size": 8, "age": "45", "review_date": "September 19, 2017"}
{"fit": "fit", "user_id": "112436", "bust size": "32b", "item_id": "298830", "weight": "115lbs", "rating": "10", "rented for": "work", "review_text": "I liked this one more than I thought I would! I was afraid it would be short, but it was fine for work. The material was nicer than I expected. Really cute print and love the asymmetrical cut. ", "body type": "straight & narrow", "review_summary": "Love this!", "category": "shift", "height": "5' 7\"", "size": 4, "age": "30", "review_date": "September 8, 2016"}
{"fit": "fit", "user_id": "335862", "bust size": "34d", "item_id": "131533", "weight": "128lbs", "rating": "10", "rented for": "party", "review_text": "The length was perfect, it all fit very true to size.", "body type": "apple", "review_summary": "I loved everything about this dress! ", "category": "gown", "height": "5' 4\"", "size": 20, "age": "52", "review_date": "January 10, 2014"}
{"fit": "fit", "user_id": "880778", "bust size": "36d", "item_id": "1726756", "weight": "174lbs", "rating": "10", "rented for": "party", "review_text": "The dress was a little tight across the chest but I am on the busty side. The details are beautiful and so is the material and color. I would def rent it again. My only regret is not getting any good photos. ", "body type": "full bust", "review_summary": "I rented this for my 35th birthday dinner. It was perfect. ", "category": "dress", "height": "5' 9\"", "size": 20, "age": "37", "review_date": "November 18, 2015"}
{"fit": "large", "user_id": "871986", "bust size": "34b", "item_id": "808736", "weight": "125lbs", "rating": "8", "rented for": "work", "review_text": "Runs a little large and long, I am 5'7 and 130 lbs and this was a tad too big and long. Overall still a great dress for work. Material is pretty thick so would be great for spring, fall. ", "body type": "straight & narrow", "review_summary": "Cute dress, thick material", "category": "dress", "height": "5' 7\"", "size": 8, "age": "32", "review_date": "August 22, 2016"}
{"fit": "fit", "user_id": "234006", "bust size": "34c", "item_id": "206536", "weight": "135lbs", "rating": "10", "rented for": "wedding", "review_text": "This dress is absolutely gorgeous and has an extremely flattering fit. The navy color is beautiful and the off the shoulder style makes it really special. Absolutely love.", "body type": "hourglass", "review_summary": "Beautiful dress for a wedding or gala event", "category": "dress", "height": "5' 8\"", "size": 12, "age": "34", "review_date": "June 1, 2017"}
{"fit": "fit", "user_id": "870233", "bust size": "40ddd/e", "item_id": "123793", "rating": "10", "rented for": "formal affair", "review_text": "The dress fit perfect. I decided to order a size up because of the type of dress and also because I am more curvy; it was a good thing I did. The dress was very comfortable and the sequins did not irritate my skin. I wore this dress to the marine corp ball and for my engagement pictures; received compliments all night long. Would definitely order this dress again !", "body type": "hourglass", "review_summary": "This dress was stunning!", "category": "gown", "height": "5' 2\"", "size": 36, "age": "21", "review_date": "November 24, 2017"}
{"fit": "fit", "user_id": "742630", "bust size": "32a", "item_id": "1923283", "weight": "110lbs", "rating": "10", "rented for": "date", "review_text": "This dress is extremely flattering and comfortable! I love the unique design and how simple it is. This runs true to size and we recommend sizing up for your backup. This is great for any cup size and the fabric is stretchy. This should be worn with a strapless bra. Pair this with a gold cuff or bracelet! ", "body type": "straight & narrow", "review_summary": "STYLIST REVIEW", "category": "dress", "height": "5' 6\"", "size": 4, "age": "24", "review_date": "July 13, 2017"}
{"fit": "fit", "user_id": "335330", "bust size": "34d", "item_id": "1730182", "weight": "135lbs", "rating": "10", "rented for": "formal affair", "review_text": "I am a true size 4 in Badgley Mischka dresses, and this was no different. I am 5'3\" and wore 4 inch heels and the regular length was perfect. I am not overly busty, but I couldn't wear a bra with this dress because it would have been too tight. Not wearing a bra was not a problem since the fabric was thick enough and ruched. However, if you have a larger chest, I would order up a size. It was very flattering (especially for someone with a booty.) I would definitely recommend! ", "body type": "hourglass", "review_summary": "Perfect color for a \"prom\" themed formal party!", "category": "gown", "height": "5' 4\"", "size": 8, "age": "28", "review_date": "April 22, 2015"}
{"fit": "fit", "user_id": "208980", "bust size": "34d", "item_id": "1851598", "weight": "143lbs", "rating": "10", "rented for": "wedding", "review_text": "LOVED IT!\nStretch fit. Thick fabric help keep everything where it should be!", "body type": "hourglass", "review_summary": "Loved the bright and fun pattern! \n", "category": "sheath", "height": "5' 4\"", "size": 20, "age": "34", "review_date": "May 31, 2016"}
{"fit": "large", "user_id": "24792", "bust size": "34b", "item_id": "2107747", "weight": "135lbs", "rating": "10", "rented for": "date", "review_text": "Want want want \nIt's such a thick cable, soft and great to wear ", "body type": "pear", "review_summary": "Brunch top for sure!! \nIt's like wearing your pajamas out in public, but looking classy and sexy. \n", "category": "sweater", "height": "5' 5\"", "size": 14, "age": "29", "review_date": "September 18, 2017"}
{"fit": "fit", "user_id": "948424", "bust size": "34c", "item_id": "1472909", "weight": "140lbs", "rating": "6", "rented for": "party", "review_text": "This was perfect for an office party. I really liked how big (very big) the skirt was. It was classy and fun. If you are anything more than a C cup, order a size bigger than 2. My boobs just barely fit.", "body type": "hourglass", "review_summary": "I liked this! But, don't wear it if you want to be really sexy.", "category": "dress", "height": "5' 6\"", "size": 4, "age": "25", "review_date": "December 15, 2014"}
{"fit": "fit", "user_id": "269712", "bust size": "34d", "item_id": "259136", "weight": "125lbs", "rating": "8", "rented for": "work", "review_text": "I was wavering between true to size and large. The fabric is stretchy and it probably runs a bit big, but I wouldn't have ordered down a size. I think if I had ordered a two, it would have been tight in the bust. The extra fabric wasn't unflattering and if anything, made it comfortable. Nicely made dress.", "body type": "full bust", "review_summary": "Great work dress", "category": "sheath", "height": "5' 2\"", "size": 8, "age": "32", "review_date": "March 1, 2016"}
{"fit": "fit", "user_id": "342682", "size": 4, "item_id": "619157", "weight": "112lbs", "rating": "10", "rented for": "wedding", "review_text": "I wore this dress at a rehearsal dinner for a formal wedding. I LOVED it! The color is kind of a neon yellow/green in person. Kind of like a tennis ball. Surprisingly pretty for such a weird color. The neckline adds a little interest to a simple, clean, but still flirty look. I got so many compliments. Also, it fits like other Elizabeth and James dresses, which is tight and non-stretchy but generally true to size. If you have bigger than a mid-sized bust, you're gonna want to size up.", "review_summary": "Love love this dress! ", "category": "dress", "height": "5' 7\"", "bust size": "32c", "age": "27", "review_date": "October 14, 2016"}
{"fit": "fit", "size": 16, "item_id": "132738", "rating": "8", "rented for": "party", "review_text": "This dress is gorgeous, but the front is VERY low cut. No bra can be worn with it the way it is. But a few pins here and there fixed it right up!", "review_summary": "I love RTR! I always feel amazing when I get a dress from them!", "category": "gown", "height": "5' 5\"", "bust size": "38d+", "user_id": "245758", "review_date": "October 4, 2014"}
{"fit": "small", "user_id": "85681", "bust size": "34c", "item_id": "135750", "weight": "115lbs", "rating": "8", "rented for": "wedding", "review_text": "Comfortable, beautiful lace. The first I dress received was damaged (big hole in lace on back) but excellent customer service - they overnighted a pristine dress in correct size to my hotel. Got lots of compliments!", "body type": "petite", "review_summary": "Black tie wedding", "category": "shift", "height": "5' 3\"", "size": 8, "age": "32", "review_date": "January 26, 2015"}
{"fit": "fit", "user_id": "769732", "bust size": "34d", "item_id": "1113191", "rating": "10", "rented for": "wedding", "review_text": "The dress fit well - both the 8 and 10. I went with the larger size as it looked a little better. The scuba material is great. The dress was incredibly comfortable and super flattering. Fun to dance in for a wedding. Fit a larger bust well. I felt very put together and the painted floral print felt special.", "body type": "full bust", "review_summary": "Comfortable and put together for a late summer outdoor wedding!", "category": "dress", "height": "5' 3\"", "size": 20, "age": "33", "review_date": "August 31, 2014"}
{"fit": "large", "user_id": "468958", "bust size": "36c", "item_id": "2410627", "weight": "160lbs", "rating": "10", "rented for": "everyday", "review_text": "Cant wait to wear this for 4th of July - it is a litle big but the straps are adjustable. It is a faltering top actually! Covers your arms the perfect amount. ", "body type": "athletic", "review_summary": "Love this top! ", "category": "top", "height": "5' 6\"", "size": 20, "age": "30", "review_date": "June 29, 2017"}
{"fit": "large", "user_id": "383116", "bust size": "34d", "item_id": "126335", "weight": "128lbs", "rating": "10", "rented for": "formal affair", "review_text": "I normally wear a 4, but ended up wearing the 2. I am 5'8\" and 126 lbs and 34D. The 4 was too big thru the hips.  The zipper was impossible to zip--but I found that if I put it on backwards and then turned it around, it worked!  ", "body type": "full bust", "review_summary": "The dress was fun, comfortable and pretty.", "category": "dress", "height": "5' 8\"", "size": 4, "age": "48", "review_date": "June 8, 2014"}
{"fit": "fit", "age": "29", "size": 35, "item_id": "962489", "weight": "170lbs", "rating": "10", "rented for": "vacation", "review_text": "Lovely dress for a summer vacation. Felt elegant and the material was thick enough to be able to wear any type of undergarments. The only downside was the middle button over my chest would come undone sometimes, but still one of my favorite dresses rented from RTR", "review_summary": "Pockets! ", "category": "dress", "height": "5' 8\"", "user_id": "771780", "review_date": "November 17, 2017"}
{"fit": "fit", "user_id": "397123", "bust size": "34b", "item_id": "982932", "weight": "128lbs", "rating": "10", "rented for": "other", "review_text": "I rented this to wear for my daughter's baptism.  It's a great dress since you can wear a regular bra with it.  The a-line made it very easy to camouflage a lower belly pooch and wider hips.  I loved how I looked in it so much I bought it!  It's my favorite date-night dress.", "body type": "pear", "review_summary": "Loved it so much, I bought it!", "category": "dress", "height": "5' 5\"", "size": 12, "age": "32", "review_date": "May 23, 2016"}
{"fit": "large", "user_id": "623308", "bust size": "34a", "item_id": "2529552", "weight": "120lbs", "rating": "10", "rented for": "other", "review_text": "Warm, comfortable, stylish, and so far looks good with everything. I LOVE this jacket. I am usually a medium, and a small is perfect for me, so order a size down.", "body type": "athletic", "review_summary": "GREAT JACKET!", "category": "jacket", "height": "5' 4\"", "size": 8, "age": "44", "review_date": "February 25, 2015"}
{"fit": "fit", "user_id": "576569", "bust size": "34b", "item_id": "1091654", "weight": "145lbs", "rating": "10", "rented for": "wedding", "review_text": "This dress was the perfect fit for a wedding, the dress code of which was \"Formal or Fabulous.\" I got compliments on it throughout the evening. It was comfortable enough to dance the night away, though some of the sequins near the arms rubbed unpleasantly against my skin. Considering it was all sequins, that's to be expected. Overall, a great experience. ", "body type": "pear", "review_summary": "Fabulous dress for a Fabulous wedding", "category": "gown", "height": "5' 5\"", "size": 12, "age": "33", "review_date": "August 17, 2016"}
{"fit": "fit", "user_id": "693094", "bust size": "34d", "item_id": "130259", "weight": "135lbs", "rating": "8", "rented for": "party", "review_text": "I wasn't so sure about this dress when I first tried it on - but I got a ton of compliments. It fit easily - and was \"small bump\" friendly (I'm pregnant and just starting to show).\n\nThe sequins were quite scratchy under the arms. I also ended up having to safety pin to show a little less cleavage. \n\nThis would be a great dress for NYE or a holiday party.", "body type": "full bust", "review_summary": "Tons of compliments", "category": "dress", "height": "5' 6\"", "size": 16, "age": "33", "review_date": "December 11, 2014"}
{"fit": "fit", "user_id": "434928", "bust size": "32b", "item_id": "2429745", "weight": "125lbs", "rating": "10", "rented for": "vacation", "review_text": "Incredibly comfortable and really flattering. Wore it to brunch on vacation. Highly recommend.", "body type": "straight & narrow", "review_summary": "Love this Romper!", "category": "romper", "height": "5' 9\"", "size": 8, "age": "36", "review_date": "March 24, 2017"}
{"fit": "fit", "user_id": "321791", "bust size": "36d", "item_id": "131533", "weight": "180lbs", "rating": "10", "rented for": "wedding", "review_text": "Loved this dress! Received compliments on it all night and felt great. When I rented they only had the long left so I just hemmed it with hem tape since I was wearing Toms. Only problem was that the zipper was extremely difficult to get up and down where the middle section comes together in the back. My fiancé had to use pliers and even then it took a lot of work. It was a little tight in the chest area (I'm a 36DD) but not too bad. Sad to see this dress go back! ", "body type": "hourglass", "review_summary": "Receiving so many compliments!", "category": "gown", "height": "5' 5\"", "size": 21, "age": "27", "review_date": "June 15, 2014"}
{"fit": "fit", "age": "38", "size": 24, "item_id": "2712258", "rating": "10", "rented for": "work", "review_text": "I am 5'2 so the pants were full length, not cropped for me.  The fabric was incredible comfortable and the fit was very flattering.", "body type": "full bust", "review_summary": "It was work", "category": "pants", "height": "5' 2\"", "user_id": "925239", "review_date": "June 9, 2017"}
{"fit": "large", "user_id": "602505", "bust size": "34b", "item_id": "193179", "rating": "10", "rented for": "wedding", "review_text": "I wore this dress for a sorority sister's wedding and I couldn't have felt better! It runs a little big in the chest, but fit the rest of me like a glove. I danced the night away feeling perfectly divine!", "body type": "hourglass", "review_summary": "Fun, Flirty and Totally Fantastic", "category": "dress", "height": "5' 6\"", "size": 20, "age": "27", "review_date": "March 3, 2014"}
{"fit": "large", "user_id": "877347", "bust size": "36d", "item_id": "1731468", "weight": "175lbs", "rating": "8", "rented for": "wedding", "review_text": "The top was a bit roomy for me as a 36 D with a shorter torso. A friend help me tie the straps together in the back to form a racer back. It looked just as good and kept the ladies in the dress. I had to size up for my chest so the skirt was voluminous and the waist very roomy on me, but my chest just wouldn't fit in the 10L.", "body type": "hourglass", "review_summary": "The dress is definitely eye catching with your décolletage on display, but still cool/comfortable.", "category": "gown", "height": "5' 9\"", "size": 24, "age": "39", "review_date": "May 1, 2017"}
{"fit": "small", "user_id": "821863", "bust size": "38c", "item_id": "168610", "rating": "8", "rented for": "party", "review_text": "Probably could have gone a size up. The dress is really tight in the bust area, took 3 people to zip it. ", "body type": "pear", "review_summary": "Beautiful dress, loved the color.", "category": "gown", "height": "5' 5\"", "size": 24, "age": "24", "review_date": "May 3, 2015"}
{"fit": "fit", "age": "30", "size": 8, "item_id": "877767", "weight": "110lbs", "rating": "10", "rented for": "wedding", "review_text": "You’ll need double sided fashion tape to keep the girls in. The 2 fit okay, but I should have went a size smaller. The dress is pretty thick and kept me warm throughout the night.", "review_summary": "I would live in this dress if I could. I felt so beautiful and it was a big hit!", "category": "gown", "height": "5' 4\"", "user_id": "169669", "review_date": "June 29, 2017"}
{"fit": "small", "user_id": "367158", "bust size": "34b", "item_id": "1379493", "weight": "130lbs", "rating": "10", "rented for": "wedding", "review_text": "Very comfortable fit, but the fabric was a tad itchy. ", "body type": "straight & narrow", "review_summary": "Perfect for an evening wedding.", "category": "dress", "height": "5' 6\"", "size": 12, "age": "32", "review_date": "October 17, 2016"}
{"fit": "large", "user_id": "767667", "bust size": "34b", "item_id": "806803", "weight": "130lbs", "rating": "10", "rented for": "wedding", "review_text": "This was a nice dress, elegant yet sexy.  I ordered the small and medium, but the small fit me perfectly (I usually buy a size medium, 6 or 8).  I wore a NuBra sticky bra and it worked fine.  The front did expose more than I like, but it wasn't that bad since i'm only a 34B, any bigger and it would have been cleavage central.  The length was perfect for a wedding, i'm 5'3\" so it covered my knees.  The open back was nice, and no one at the wedding had a dress like mine.  Very happy with this rental, I was iffy at first, but i'm glad I did it.\n", "body type": "pear", "review_summary": "Perfect fit, classy and sexy", "category": "dress", "height": "5' 3\"", "size": 8, "age": "36", "review_date": "October 8, 2014"}
{"fit": "small", "user_id": "671344", "bust size": "34c", "item_id": "1764436", "weight": "140lbs", "rating": "10", "rented for": "everyday", "review_text": "This dress is definitely on the smaller size so wild recommend sizing up. I needed help with the zipper and realized I would never be able to go to the restroom on my own! It's a beautiful dress and will be ordering again when the size up becomes available.        ", "body type": "pear", "review_summary": "Great material and form fitting!", "category": "sheath", "height": "5' 3\"", "size": 12, "age": "30", "review_date": "May 5, 2017"}
{"fit": "fit", "user_id": "297874", "bust size": "34b", "item_id": "734229", "weight": "128lbs", "rating": "8", "rented for": "wedding", "review_text": "I loved the pattern and soft blush color, but was a little nervous that the blush would appear white under certain lighting, as I was a guest at a wedding.   I think the color is fine in person, but the dress does look white in some of the photos from the event.  I loved how light and airy the dress was, but the arm holes made me have a bit of an underarm roll depending on my arm position/posture-- which I was fairly self-conscious about.  The lining wrinkled quickly (it was a very hot day), but you couldn't tell because of the flare of the skirt.  The dress was perfect for dancing, and the rental process was SO smooth.  I would definitely use Rent the Runway again.", "body type": "apple", "review_summary": "Pretty dress, easy rental process!", "category": "dress", "height": "5' 4\"", "size": 12, "age": "29", "review_date": "July 25, 2016"}
{"fit": "small", "user_id": "53744", "bust size": "34c", "item_id": "714374", "weight": "128lbs", "rating": "10", "rented for": "formal affair", "review_text": "I usually wear a size 4 but I felt this dress ran a little tight...so the size 6 was perfect and comfortable. This was my first RTR experience and I will definitely do it again.  The cut out on the sides make the dress super sexy, without being too revealing.  ", "body type": "athletic", "review_summary": "I got so many compliments all night long! It is a great combo of classy & sexy!", "category": "dress", "height": "5' 4\"", "size": 12, "age": "33", "review_date": "July 17, 2016"}
{"fit": "fit", "user_id": "203660", "bust size": "34c", "item_id": "1126889", "weight": "160lbs", "rating": "6", "rented for": "party", "review_text": "The dress is absolutely gorgeous, unfortunately the dress proportions were off for my height. I would have loved to wear this out, but I couldn't because the lengths were awkward on my body. ", "body type": "athletic", "review_summary": "Too Long", "category": "dress", "height": "5' 4\"", "size": 12, "age": "28", "review_date": "January 3, 2017"}
{"fit": "fit", "user_id": "704778", "bust size": "32b", "item_id": "1415952", "weight": "140lbs", "rating": "10", "rented for": "party", "review_text": "Hey you! Stop looking. You've found the dress you're looking for. This is tops! Quality matches price! \n\nAbout me: I am 5'8' and 141 lbs. I have an athletic body, longer torso, shorter legs. \n\nRE: FIT/STRETCH. Because there is no stretch it this at all, this fits true to size. So, if you are a 4/6 girl (like me), order the 6. Whereas, if you're a 4/6 girl and you've been watching those sweets for a couple weeks, then you'll be able to wear the 4.  I ordered both!  I was worried I wouldn't be able to sit in this, but I was able to sit just fine, in both the 4 and 6.  I was \"worried\" that the sleeves wouldn't fit my arms (I do back/bi and chest/tri every week), yet the sleeves were fit perfectly!\n\nRE: LENGTH/SEXINESS. I felt that the dress was appropriately long. By today's trends, most gals would say it's way too long. And in fact, it would probably be too long for a petite woman. However, for my Bridal Shower, it really made a lovely statement, by being sexy (with it's illusion top and glittery \"burnt\" rose gold) without being too sexy (appropriate length, covered chest).  From the pictures, you can tell that I am very, very, very pale. The illusion netting was a different color from my skin, but I didn't mind one bit. If that's a concern of yours, you can always wear panty hose to match. \n\nRE: ACCESSORIES: I wore dainty drop pink pearl earrings and matching bracelet and my engagement ring. My shoes were plain nude peep-toe pumps.\n", "body type": "athletic", "review_summary": "Bridal Party Show Stopper! <3 ", "category": "sheath", "height": "5' 8\"", "size": 8, "age": "28", "review_date": "December 4, 2016"}
{"fit": "fit", "user_id": "650436", "bust size": "34ddd/e", "item_id": "1009845", "weight": "130lbs", "rating": "8", "rented for": "party", "review_text": "The dress was classy, I wore it to a formal lunch event, and it fit great. However, the shoulders/sleeves (whatever you want to call it) were awkward to me at first. It's kind of off-the-shoulder, but not completely... anyway, it was fine but I was self-conscious about keeping the straps at exactly the right level (otherwise the material stretches in an unflattering way) so I wouldn't rent it again if you plan on dancing or moving around a lot. If you just need to sit and look pretty then it'll probably be fine. Other wise the dress was really pretty and I received a lot of compliments. One last thing; I am busty, and I was able to wear a strapless bra, but I had to be aware of the dress slipping down at times and exposing the bra on the side. Not a deal-breaker, but it wasn't a worry-free style for me. ", "body type": "hourglass", "review_summary": "A classy dress, beautiful red", "category": "dress", "height": "5' 2\"", "size": 16, "age": "33", "review_date": "June 13, 2017"}
{"fit": "fit", "user_id": "545501", "bust size": "34d", "item_id": "1987884", "weight": "145lbs", "rating": "10", "rented for": "party", "review_text": "This dress was perfect and true to size. Usually I'm between an 8 and a 10 depending on the cut of the dress, but since this one flared out at the hips the 8 was perfect. The material was gorgeous and comfortable and I could wear a normal bra so I consider this really easy to wear.  ", "body type": "pear", "review_summary": "Great Work Holiday Party Dress!", "category": "dress", "height": "5' 5\"", "size": 16, "age": "29", "review_date": "December 11, 2017"}
{"fit": "fit", "user_id": "669880", "bust size": "34c", "item_id": "1896920", "weight": "134lbs", "rating": "10", "rented for": "formal affair", "review_text": "I go so many complements on this dress the whole night. It was a formal event but there was a lot of dancing involved. The fact that the dress is actually so short kept me from becoming a hot mess while still looking elegant. It's slim fitting, so be ready to \"suck it in\" with any size you get. It's a long dress and it would have been dragging if I didn't have heels on. ", "body type": "hourglass", "review_summary": "I wore this to a masquerade ball, the perfect occasion for this dress. ", "category": "gown", "height": "5' 6\"", "size": 16, "age": "27", "review_date": "March 7, 2015"}
{"fit": "fit", "user_id": "968848", "bust size": "36c", "item_id": "714374", "weight": "150lbs", "rating": "10", "rented for": "work", "review_text": "Very comfortable. Stretchy in the bottom and fit well in the top.", "body type": "hourglass", "review_summary": "Got the dress ahead of schedule which was great. It fit well and got lots of compliments.", "category": "dress", "height": "5' 6\"", "size": 12, "age": "28", "review_date": "May 2, 2016"}
{"fit": "fit", "user_id": "486976", "bust size": "36c", "item_id": "1414750", "weight": "155lbs", "rating": "8", "rented for": "party", "review_text": "Sweater material will stretch out especially if you're seated for a while.  By the end of the night it lost most of its shape and hung like a loose bag.   If you're planning to spend most of the event standing it will fit like a glove and be super comfortable.", "body type": "athletic", "review_summary": "Great dress, comfortable but as with all sweater material it stretched out as the evening went on. ", "category": "sheath", "height": "5' 9\"", "size": 14, "age": "32", "review_date": "November 20, 2017"}
{"fit": "fit", "user_id": "538528", "bust size": "36c", "item_id": "672419", "weight": "140lbs", "rating": "10", "rented for": "wedding", "review_text": "I ended up wearing a different option from Rent the Runway since this dress was a little too formal for the wedding I was attending.  However, I absolutely loved this dress.  It is elegant and unique.  It is form fitting but the best part is that the material has a little stretch so it conforms to your body for an exact fit.  The material is high quality and the beading detail is intricate.  I highly recommend this dress for a black tie event.", "body type": "pear", "review_summary": "This dress is high quality and a beautiful vibrant color.", "category": "gown", "height": "5' 2\"", "size": 15, "age": "36", "review_date": "November 7, 2017"}
{"fit": "fit", "user_id": "428934", "bust size": "32c", "item_id": "174086", "weight": "130lbs", "rating": "10", "rented for": "wedding", "review_text": "The dress fit perfectly and looked absoultely great!! I got so many compliments on the dress. I hope it comes in other colors!! I went with the 2 and it was a perfect fit and very flattering on! Highly recomend this dress. ", "body type": "pear", "review_summary": "PERFECT!!", "category": "dress", "height": "5' 5\"", "size": 4, "age": "36", "review_date": "May 28, 2013"}
{"fit": "fit", "user_id": "713380", "bust size": "36c", "item_id": "838983", "weight": "175lbs", "rating": "10", "rented for": "party", "review_text": "The lace cut-out details were really cool and the fabric gives this dress a sophisticated, edgy feel!  Lots of compliments all night and no extra jewelry required! The dress speaks for itself!", "body type": "apple", "review_summary": "i was looking for an updated look to the 1946 movie \"It's a Wonderful Life\" - this dress was perfect", "category": "sheath", "height": "5' 6\"", "size": 20, "age": "49", "review_date": "December 15, 2014"}